examples/Resources/Catalyst_P-0.15_n-7_nl-2_Re-20/MomentumSolution/stationary_solution/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
132485
(
-0.000479135
-0.00102923
-0.00138459
0.000479063
-3.22717e-10
-0.000529141
-0.00108482
0.00102922
...
)
;

boundaryField
{
    fluidInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
465
(
0.00958801
0.00880337
0.0080186
0.00723363
0.00943274
0.00855798
0.00768325
0.00680857
...
)
;
    }
    fluidOutlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
465
(
0.00958801
0.00880337
0.0080186
0.00723363
0.00943274
0.00855798
0.00768325
0.00680857
...
)
;
    }
    cylExtSurf
    {
        type            calculated;
        value           nonuniform List<scalar> 
7452
(
0.00997261
0.00997261
0.00986335
0.00986335
0.00964602
0.00964602
0.00932301
0.00932301
...
)
;
    }
    inletCatalystFluidWall_to_inletCatalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
1330
(
-0.00485642
-0.00526174
-0.00427023
-0.00469303
-0.00376805
-0.00420124
-0.00466111
-0.00329565
...
)
;
    }
    outletCatalystFluidWall_to_outletCatalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
2085
(
-0.00605697
-0.00468311
-0.00631378
-0.00557843
-0.00582925
-0.00492352
-0.0051124
-0.00535754
...
)
;
    }
    Channels_to_Catalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
39784
(
-0.00144255
0.00144255
-3.87839e-08
-0.00144255
0.00144255
-3.88279e-08
-0.00144255
0.00144255
...
)
;
    }
}


// ************************************************************************* //
