examples/Resources/Catalyst_P-0.15_n-7_nl-2_Re-20/MomentumSolution/stationary_solution/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
132485
(
0.00360797
0.00307817
0.00258871
0.00360798
0.00285076
0.00233445
0.00207923
0.00307821
...
)
;

boundaryField
{
    fluidInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
465
(
0.000499869
0.000428103
0.000356327
0.000284532
0.00146675
0.001253
0.00103925
0.000825517
...
)
;
    }
    fluidOutlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
465
(
0.000499869
0.000428103
0.000356327
0.000284532
0.00146675
0.001253
0.00103925
0.000825517
...
)
;
    }
    cylExtSurf
    {
        type            calculated;
        value           nonuniform List<scalar> 
7452
(
0.000522642
0.000522642
0.0015622
0.0015622
0.00258464
0.00258464
0.00357877
0.00357877
...
)
;
    }
    inletCatalystFluidWall_to_inletCatalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
1330
(
0.00194299
0.00146969
0.00143082
0.000953755
0.000945265
0.000472983
-1.40171e-11
0.00047098
...
)
;
    }
    outletCatalystFluidWall_to_outletCatalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
2085
(
0.00400591
0.00294176
0.00368189
0.00364075
0.00334163
0.0026858
0.00328186
0.00300627
...
)
;
    }
    Channels_to_Catalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
39784
(
0.00258878
0.00258887
0.00105712
0.00258878
0.00258887
0.00105712
0.00258878
0.00258887
...
)
;
    }
}


// ************************************************************************* //
