examples/Resources/Catalyst_P-0.15_n-7_nl-2_Re-20/MomentumSolution/stationary_solution/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
132485
(
0.00749999
0.00749997
0.0075
0.00749999
0.00766667
0.00766667
0.00749997
0.00749997
...
)
;

boundaryField
{
    fluidInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
465
(
-0.09
-0.09
-0.09
-0.09
-0.09
-0.09
-0.09
-0.09
...
)
;
    }
    fluidOutlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
465
(
0.09
0.09
0.09
0.09
0.09
0.09
0.09
0.09
...
)
;
    }
    cylExtSurf
    {
        type            calculated;
        value           nonuniform List<scalar> 
7452
(
-0.0676559
-0.0669879
-0.0676559
-0.0669879
-0.0676559
-0.0669879
-0.0676559
-0.066988
...
)
;
    }
    inletCatalystFluidWall_to_inletCatalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
1330
(
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
...
)
;
    }
    outletCatalystFluidWall_to_outletCatalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
2085
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    Channels_to_Catalyst
    {
        type            calculated;
        value           nonuniform List<scalar> 
39784
(
0.0075
0.0075
0.0075
0.00816667
0.00816667
0.00816667
0.00883333
0.00883333
...
)
;
    }
}


// ************************************************************************* //
