examples/Resources/Catalyst_P-0.15_n-7_nl-2_Re-20/MomentumSolution/stationary_solution/0/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
132485
(
4.16953e-11
4.63157e-11
1.34459e-11
4.17024e-11
3.57184e-10
3.61909e-10
4.98678e-11
4.63153e-11
...
)
;

boundaryField
{
    fluidInlet
    {
        type            calculated;
        value           uniform 0;
    }
    fluidOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    cylExtSurf
    {
        type            calculated;
        value           uniform 0;
    }
    inletCatalystFluidWall_to_inletCatalyst
    {
        type            calculated;
        value           uniform 0;
    }
    outletCatalystFluidWall_to_outletCatalyst
    {
        type            calculated;
        value           uniform 0;
    }
    Channels_to_Catalyst
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
