examples/Resources/Catalyst_P-0.15_n-7_nl-2_Re-20/MomentumSolution/stationary_solution/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];
internalField uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    fluidInlet
    {
        type            zeroGradient;
    }

    fluidOutlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    cylExtSurf
    {
        type            zeroGradient;
    }

    Channels_to_Catalyst
    {
        type            zeroGradient;
    }

    inletCatalystFluidWall_to_inletCatalyst
    {
        type            zeroGradient;
    }

    outletCatalystFluidWall_to_outletCatalyst
    {
        type            zeroGradient;
    }

    y0symsurf
    {
        type            symmetry;
    }

    x0symsurf
    {
        type            symmetry;
    }
}

// ************************************************************************* //
