examples/Resources/Catalyst_P-0.15_n-7_nl-2_Re-20/MomentumSolution/stationary_solution/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

flurho $RHO;
refPressure $caseOutletp;
WIS $writeIntervalStationary;

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         $endTStationary;

deltaT          #calc "$WIS * 0.5";

writeControl    timeStep;

writeInterval   $writeIntervalStationary;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  dynamicP_to_StaticP
  {
      // Mandatory entries (unmodifiable)
      type        pressure;
      libs        ("libfieldFunctionObjects.so");
      field       p;
      rho         uniform $flurho;
      U           U;
      pRef        $refPressure;
      calcTotal   no;
      calcCoeff   no;
  }
}


// ************************************************************************* //
